MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>STM32F334x</name>
	<version>1.0</version>
	<description>STM32F334x</description>
	<!--Bus Interface Properties-->
	<!--Cortex-M4 is byte addressable-->
	<addressUnitBits>8</addressUnitBits>
	<!--the maximum data bit width accessible within a single transfer-->
	<width>32</width>
	<!--Register Default Properties-->
	<size>0x20</size>
	<resetValue>0x0</resetValue>
	<resetMask>0xFFFFFFFF</resetMask>
	<peripherals>
		<peripheral>
			<name>GPIOA</name>
			<description>General-purpose I/Os</description>
			<groupName>GPIO</groupName>
			<baseAddress>0x48000000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>MODER</name>
					<displayName>MODER</displayName>
					<description>GPIO port mode register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x28000000</resetValue>
					<fields>
						<field>
							<name>MODER15</name>
							<description>Pin 15 mode</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>MODER</name>
								<enumeratedValue>
									<name>Input</name>
									<description>Input mode (reset state)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Output</name>
									<description>General purpose output mode</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Alternate</name>
									<description>Alternate function mode</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Analog</name>
									<description>Analog mode</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODER14</name>
							<description>Pin 14 mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER13</name>
							<description>Pin 13 mode</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER12</name>
							<description>Pin 12 mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER11</name>
							<description>Pin 11 mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER10</name>
							<description>Pin 10 mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER9</name>
							<description>Pin 9 mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER8</name>
							<description>Pin 8 mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER7</name>
							<description>Pin 7 mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER6</name>
							<description>Pin 6 mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER5</name>
							<description>Pin 5 mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER4</name>
							<description>Pin 4 mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER3</name>
							<description>Pin 3 mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER2</name>
							<description>Pin 2 mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER1</name>
							<description>Pin 1 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
						<field>
							<name>MODER0</name>
							<description>Pin 0 mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="MODER" />
						</field>
					</fields>
				</register>
				<register>
					<name>OTYPER</name>
					<displayName>OTYPER</displayName>
					<description>GPIO port output type register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OT15</name>
							<description>Pin 15 output type</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>

							<enumeratedValues>
								<name>OT</name>
								<enumeratedValue>
									<name>push_pull</name>
									<description>Output push-pull (reset state)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>open_drain</name>
									<description>Output open-drain</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>

