MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
						</field>
						<field>
							<name>OT14</name>
							<description>Pin 14 output type</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT13</name>
							<description>Pin 13 output type</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT12</name>
							<description>Pin 12 output type</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT11</name>
							<description>Pin 11 output type</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT10</name>
							<description>Pin 10 output type</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT9</name>
							<description>Pin 9 output type</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT8</name>
							<description>Pin 8 output type</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT7</name>
							<description>Pin 7 output type</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT6</name>
							<description>Pin 6 output type</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT5</name>
							<description>Pin 5 output type</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT4</name>
							<description>Pin 4 output type</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT3</name>
							<description>Pin 3 output type</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT2</name>
							<description>Pin 2 output type</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT1</name>
							<description>Pin 1 output type</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
						<field>
							<name>OT0</name>
							<description>Pin 0 output type</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues derivedFrom="OT" />
						</field>
					</fields>
				</register>
				<register>
					<name>OSPEEDR</name>
					<displayName>OSPEEDR</displayName>
					<description>GPIO port output speed register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OSPEEDR15</name>
							<description>Pin 15 output speed</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>OSPEEDR</name>
								<enumeratedValue>
									<name>Low_speed</name>
									<description>Low speed</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Medium_speed</name>
									<description>Medium speed</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High_speed</name>
									<description>High speed</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSPEEDR14</name>
							<description>Pin 14 output speed</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR13</name>
							<description>Pin 13 output speed</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR12</name>
							<description>Pin 12 output speed</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR11</name>
							<description>Pin 11 output speed</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR10</name>
							<description>Pin 10 output speed</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR9</name>
							<description>Pin 9 output speed</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR8</name>
							<description>Pin 8 output speed</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR7</name>
							<description>Pin 8 output speed</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR6</name>
							<description>Pin 6 output speed</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR5</name>
							<description>Pin 5 output speed</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR4</name>
							<description>Pin 4 output speed</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR3</name>
							<description>Pin 3 output speed</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR2</name>
							<description>Pin 2 output speed</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR1</name>
							<description>Pin 1 output speed</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
						<field>
							<name>OSPEEDR0</name>
							<description>Pin 0 output speed</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="OSPEEDR" />
						</field>
					</fields>
				</register>
				<register>
					<name>PUPDR</name>
					<displayName>PUPDR</displayName>
					<description>GPIO port pull-up/pull-down register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x64000000</resetValue>
					<fields>
						<field>
							<name>PUPDR15</name>
							<description>Pin 15 pull-up/pull-down state</description>
							<bitOffset>30</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>PUPDR</name>
								<enumeratedValue>
									<name>None</name>
									<description>No pull-up, pull-down</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull_up</name>
									<description>Pull-up</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Pull_down</name>
									<description>Pull-down</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PUPDR14</name>
							<description>Pin 14 pull-up/pull-down state</description>
							<bitOffset>28</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR13</name>
							<description>Pin 13 pull-up/pull-down state</description>
							<bitOffset>26</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR12</name>
							<description>Pin 12 pull-up/pull-down state</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR11</name>
							<description>Pin 11 pull-up/pull-down state</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR10</name>
							<description>Pin 10 pull-up/pull-down state</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR9</name>
							<description>Pin 9 pull-up/pull-down state</description>
							<bitOffset>18</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR8</name>
							<description>Pin 8 pull-up/pull-down state</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR7</name>
							<description>Pin 7 pull-up/pull-down state</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR6</name>
							<description>Pin 6 pull-up/pull-down state</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR5</name>
							<description>Pin 5 pull-up/pull-down state</description>
							<bitOffset>10</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR4</name>
							<description>Pin 4 pull-up/pull-down state</description>
							<bitOffset>8</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR3</name>
							<description>Pin 3 pull-up/pull-down state</description>
							<bitOffset>6</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR2</name>
							<description>Pin 2 pull-up/pull-down state</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR1</name>
							<description>Pin 1 pull-up/pull-down state</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
						<field>
							<name>PUPDR0</name>
							<description>Pin 0 pull-up/pull-down state</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="PUPDR" />
						</field>
					</fields>
				</register>
				<register>
					<name>IDR</name>
					<displayName>IDR</displayName>
					<description>GPIO port input data register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFF0000</resetMask>
					<fields>
						<field>
							<name>IDR15</name>
							<description>Pin 15 input data</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR14</name>
							<description>Pin 14 input data</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR13</name>
							<description>Pin 13 input data</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR12</name>
							<description>Pin 12 input data</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR11</name>
							<description>Pin 11 input data</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR10</name>
							<description>Pin 10 input data</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR9</name>
							<description>Pin 9 input data</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR8</name>
							<description>Pin 8 input data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR7</name>
							<description>Pin 7 input data</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR6</name>
							<description>Pin 6 input data</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR5</name>
							<description>Pin 5 input data</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR4</name>
							<description>Pin 4 input data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR3</name>
							<description>Pin 3 input data</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR2</name>
							<description>Pin 2 input data</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR1</name>
							<description>Pin 1 input data</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDR0</name>
							<description>Pin 0 input data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ODR</name>
					<displayName>ODR</displayName>
					<description>GPIO port output data register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ODR15</name>
							<description>Pin 15 output data</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR14</name>
							<description>Pin 14 output data</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR13</name>
							<description>Pin 13 output data</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR12</name>
							<description>Pin 12 output data</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR11</name>
							<description>Pin 11 output data</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR10</name>
							<description>Pin 10 output data</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR9</name>
							<description>Pin 9 output data</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR8</name>
							<description>Pin 8 output data</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR7</name>
							<description>Pin 7 output data</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR6</name>
							<description>Pin 6 output data</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR5</name>
							<description>Pin 5 output data</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR4</name>
							<description>Pin 4 output data</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR3</name>
							<description>Pin 3 output data</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR2</name>
							<description>Pin 2 output data</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR1</name>
							<description>Pin 1 output data</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ODR0</name>
							<description>Pin 0 output data</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
