MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>BSRR</name>
					<displayName>BSRR</displayName>
					<description>GPIO port bit set/reset register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR15</name>
							<description>Pin 15 reset bit</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR14</name>
							<description>Pin 14 reset bit</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR13</name>
							<description>Pin 13 reset bit</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR12</name>
							<description>Pin 12 reset bit</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR11</name>
							<description>Pin 11 reset bit</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR10</name>
							<description>Pin 10 reset bit</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR9</name>
							<description>Pin 9 reset bit</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR8</name>
							<description>Pin 8 reset bit</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR7</name>
							<description>Pin 7 reset bit</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR6</name>
							<description>Pin 6 reset bit</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR5</name>
							<description>Pin 5 reset bit</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR4</name>
							<description>Pin 4 reset bit</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR3</name>
							<description>Pin 3 reset bit</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR2</name>
							<description>Pin 2 reset bit</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR1</name>
							<description>Pin 1 reset bit</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR0</name>
							<description>Pin 0 reset bit</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS15</name>
							<description>Pin 15 set bit</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS14</name>
							<description>Pin 14 set bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS13</name>
							<description>Pin 13 set bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS12</name>
							<description>Pin 12 set bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS11</name>
							<description>Pin 11 set bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS10</name>
							<description>Pin 10 set bit</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS9</name>
							<description>Pin 9 set bit</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS8</name>
							<description>Pin 8 set bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS7</name>
							<description>Pin 7 set bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS6</name>
							<description>Pin 6 set bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS5</name>
							<description>Pin 5 set bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS4</name>
							<description>Pin 4 set bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS3</name>
							<description>Pin 3 set bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS2</name>
							<description>Pin 2 set bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS1</name>
							<description>Pin 1 set bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BS0</name>
							<description>Pin 0 set bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>LCKR</name>
					<displayName>LCKR</displayName>
					<description>GPIO port configuration lock register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>LCKK</name>
							<description>Lock Key</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK15</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK14</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK13</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK12</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK11</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK10</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK9</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK8</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK7</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK6</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK5</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK4</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK3</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK2</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK1</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>LCK0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AFRL</name>
					<displayName>AFRL</displayName>
					<description>GPIO alternate function low register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFRL7</name>
							<description>Alternate function for pin 7</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<name>AFR</name>
								<enumeratedValue> <name>AF0</name>  <value>#0000</value> </enumeratedValue>
								<enumeratedValue> <name>AF1</name>  <value>#0001</value> </enumeratedValue>
								<enumeratedValue> <name>AF2</name>  <value>#0010</value> </enumeratedValue>
								<enumeratedValue> <name>AF3</name>  <value>#0011</value> </enumeratedValue>
								<enumeratedValue> <name>AF4</name>  <value>#0100</value> </enumeratedValue>
								<enumeratedValue> <name>AF5</name>  <value>#0101</value> </enumeratedValue>
								<enumeratedValue> <name>AF6</name>  <value>#0110</value> </enumeratedValue>
								<enumeratedValue> <name>AF7</name>  <value>#0111</value> </enumeratedValue>
								<enumeratedValue> <name>AF8</name>  <value>#1000</value> </enumeratedValue>
								<enumeratedValue> <name>AF9</name>  <value>#1001</value> </enumeratedValue>
								<enumeratedValue> <name>AF10</name> <value>#1010</value> </enumeratedValue>
								<enumeratedValue> <name>AF11</name> <value>#1011</value> </enumeratedValue>
								<enumeratedValue> <name>AF12</name> <value>#1100</value> </enumeratedValue>
								<enumeratedValue> <name>AF13</name> <value>#1101</value> </enumeratedValue>
								<enumeratedValue> <name>AF14</name> <value>#1110</value> </enumeratedValue>
								<enumeratedValue> <name>AF15</name> <value>#1111</value> </enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AFRL6</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL5</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL4</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL3</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL2</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL1</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
						<field>
							<name>AFRL0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFR" />
						</field>
					</fields>
				</register>
				<register>
					<name>AFRH</name>
					<displayName>AFRH</displayName>
					<description>GPIO alternate function high register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AFRH15</name>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH14</name>
							<bitOffset>24</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH13</name>
							<bitOffset>20</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH12</name>
							<bitOffset>16</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH11</name>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH10</name>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH9</name>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
						<field>
							<name>AFRH8</name>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues derivedFrom="AFRL.AFRL7.AFR" />
						</field>
					</fields>
				</register>
				<register>
					<name>BRR</name>
					<displayName>BRR</displayName>
					<description>Port bit reset register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BR0</name>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR1</name>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR2</name>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR3</name>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR4</name>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR5</name>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR6</name>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR7</name>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR8</name>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR9</name>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR10</name>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR11</name>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR12</name>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR13</name>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR14</name>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BR15</name>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
