MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>IOSCR</name>
					<displayName>IOSCR</displayName>
					<description>I/O sampling control register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>G1_IO1</name>
							<description>G1_IO1 sampling mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO2</name>
							<description>G1_IO2 sampling mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO3</name>
							<description>G1_IO3 sampling mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO4</name>
							<description>G1_IO4 sampling mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO1</name>
							<description>G2_IO1 sampling mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO2</name>
							<description>G2_IO2 sampling mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO3</name>
							<description>G2_IO3 sampling mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO4</name>
							<description>G2_IO4 sampling mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO1</name>
							<description>G3_IO1 sampling mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO2</name>
							<description>G3_IO2 sampling mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO3</name>
							<description>G3_IO3 sampling mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO4</name>
							<description>G3_IO4 sampling mode</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO1</name>
							<description>G4_IO1 sampling mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO2</name>
							<description>G4_IO2 sampling mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO3</name>
							<description>G4_IO3 sampling mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO4</name>
							<description>G4_IO4 sampling mode</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO1</name>
							<description>G5_IO1 sampling mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO2</name>
							<description>G5_IO2 sampling mode</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO3</name>
							<description>G5_IO3 sampling mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO4</name>
							<description>G5_IO4 sampling mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO1</name>
							<description>G6_IO1 sampling mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO2</name>
							<description>G6_IO2 sampling mode</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO3</name>
							<description>G6_IO3 sampling mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO4</name>
							<description>G6_IO4 sampling mode</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO1</name>
							<description>G7_IO1 sampling mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO2</name>
							<description>G7_IO2 sampling mode</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO3</name>
							<description>G7_IO3 sampling mode</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO4</name>
							<description>G7_IO4 sampling mode</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO1</name>
							<description>G8_IO1 sampling mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO2</name>
							<description>G8_IO2 sampling mode</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO3</name>
							<description>G8_IO3 sampling mode</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO4</name>
							<description>G8_IO4 sampling mode</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOCCR</name>
					<displayName>IOCCR</displayName>
					<description>I/O channel control register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>G1_IO1</name>
							<description>G1_IO1 channel mode</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO2</name>
							<description>G1_IO2 channel mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO3</name>
							<description>G1_IO3 channel mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G1_IO4</name>
							<description>G1_IO4 channel mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO1</name>
							<description>G2_IO1 channel mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO2</name>
							<description>G2_IO2 channel mode</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO3</name>
							<description>G2_IO3 channel mode</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G2_IO4</name>
							<description>G2_IO4 channel mode</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO1</name>
							<description>G3_IO1 channel mode</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO2</name>
							<description>G3_IO2 channel mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO3</name>
							<description>G3_IO3 channel mode</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G3_IO4</name>
							<description>G3_IO4 channel mode</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO1</name>
							<description>G4_IO1 channel mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO2</name>
							<description>G4_IO2 channel mode</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO3</name>
							<description>G4_IO3 channel mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G4_IO4</name>
							<description>G4_IO4 channel mode</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO1</name>
							<description>G5_IO1 channel mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO2</name>
							<description>G5_IO2 channel mode</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO3</name>
							<description>G5_IO3 channel mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G5_IO4</name>
							<description>G5_IO4 channel mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO1</name>
							<description>G6_IO1 channel mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO2</name>
							<description>G6_IO2 channel mode</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO3</name>
							<description>G6_IO3 channel mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G6_IO4</name>
							<description>G6_IO4 channel mode</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO1</name>
							<description>G7_IO1 channel mode</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO2</name>
							<description>G7_IO2 channel mode</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO3</name>
							<description>G7_IO3 channel mode</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G7_IO4</name>
							<description>G7_IO4 channel mode</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO1</name>
							<description>G8_IO1 channel mode</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO2</name>
							<description>G8_IO2 channel mode</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO3</name>
							<description>G8_IO3 channel mode</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>G8_IO4</name>
							<description>G8_IO4 channel mode</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOGCSR</name>
					<displayName>IOGCSR</displayName>
					<description>I/O group control status register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>G8S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G7S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G6S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G5S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G4S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G3S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G2S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G1S</name>
							<description>Analog I/O group x status</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>G8E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G7E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G6E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G5E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G4E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G3E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G2E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>G1E</name>
							<description>Analog I/O group x enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG1CR</name>
					<displayName>IOG1CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG2CR</name>
					<displayName>IOG2CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG3CR</name>
					<displayName>IOG3CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x3C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG4CR</name>
					<displayName>IOG4CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG5CR</name>
					<displayName>IOG5CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG6CR</name>
					<displayName>IOG6CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG7CR</name>
					<displayName>IOG7CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IOG8CR</name>
					<displayName>IOG8CR</displayName>
					<description>I/O group x counter register</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNT</name>
							<description>Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>14</bitWidth>
						</field>
					</fields>
				</register>
