MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>COMP</name>
			<description>Comparator</description>
			<groupName>COMP</groupName>
			<baseAddress>0x4001001C</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x19</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>COMP123</name>
				<description>COMP1 &amp; COMP2 &amp; COMP3 interrupts combined with EXTI Lines 21, 22 and 29 interrupts</description>
				<value>64</value>
			</interrupt>
			<interrupt>
				<name>COMP456</name>
				<description>COMP4 &amp; COMP5 &amp; COMP6 interrupts combined with EXTI Lines 30, 31 and 32 interrupts</description>
				<value>65</value>
			</interrupt>
			<interrupt>
				<name>COMP7</name>
				<description>COMP7 interrupt combined with EXTI Line 33 interrupt</description>
				<value>66</value>
			</interrupt>
			<registers>
				<register>
					<name>COMP1_CSR</name>
					<displayName>COMP1_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP1EN</name>
							<description>Comparator 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_INP_DAC</name>
							<description>COMP1_INP_DAC</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1MODE</name>
							<description>Comparator 1 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1INSEL</name>
							<description>Comparator 1 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_OUT_SEL</name>
							<description>Comparator 1 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1POL</name>
							<description>Comparator 1 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1HYST</name>
							<description>Comparator 1 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1_BLANKING</name>
							<description>Comparator 1 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP1OUT</name>
							<description>Comparator 1 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP1LOCK</name>
							<description>Comparator 1 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP2_CSR</name>
					<displayName>COMP2_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP2EN</name>
							<description>Comparator 2 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2MODE</name>
							<description>Comparator 2 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2INSEL</name>
							<description>Comparator 2 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2INPSEL</name>
							<description>Comparator 2 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2INMSEL</name>
							<description>Comparator 1inverting input selection</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_OUT_SEL</name>
							<description>Comparator 2 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2POL</name>
							<description>Comparator 2 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2HYST</name>
							<description>Comparator 2 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2_BLANKING</name>
							<description>Comparator 2 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP2OUT</name>
							<description>Comparator 2 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP2LOCK</name>
							<description>Comparator 2 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP3_CSR</name>
					<displayName>COMP3_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP3EN</name>
							<description>Comparator 3 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3MODE</name>
							<description>Comparator 3 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3INSEL</name>
							<description>Comparator 3 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3INPSEL</name>
							<description>Comparator 3 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_OUT_SEL</name>
							<description>Comparator 3 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3POL</name>
							<description>Comparator 3 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3HYST</name>
							<description>Comparator 3 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3_BLANKING</name>
							<description>Comparator 3 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP3OUT</name>
							<description>Comparator 3 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP3LOCK</name>
							<description>Comparator 3 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP4_CSR</name>
					<displayName>COMP4_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP4EN</name>
							<description>Comparator 4 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4MODE</name>
							<description>Comparator 4 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4INSEL</name>
							<description>Comparator 4 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4INPSEL</name>
							<description>Comparator 4 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COM4WINMODE</name>
							<description>Comparator 4 window mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4_OUT_SEL</name>
							<description>Comparator 4 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4POL</name>
							<description>Comparator 4 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4HYST</name>
							<description>Comparator 4 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4_BLANKING</name>
							<description>Comparator 4 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP4OUT</name>
							<description>Comparator 4 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP4LOCK</name>
							<description>Comparator 4 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP5_CSR</name>
					<displayName>COMP5_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP5EN</name>
							<description>Comparator 5 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5MODE</name>
							<description>Comparator 5 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5INSEL</name>
							<description>Comparator 5 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5INPSEL</name>
							<description>Comparator 5 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5_OUT_SEL</name>
							<description>Comparator 5 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5POL</name>
							<description>Comparator 5 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5HYST</name>
							<description>Comparator 5 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5_BLANKING</name>
							<description>Comparator 5 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP5OUT</name>
							<description>Comparator51 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP5LOCK</name>
							<description>Comparator 5 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP6_CSR</name>
					<displayName>COMP6_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP6EN</name>
							<description>Comparator 6 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6MODE</name>
							<description>Comparator 6 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6INSEL</name>
							<description>Comparator 6 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6INPSEL</name>
							<description>Comparator 6 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COM6WINMODE</name>
							<description>Comparator 6 window mode</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6_OUT_SEL</name>
							<description>Comparator 6 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6POL</name>
							<description>Comparator 6 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6HYST</name>
							<description>Comparator 6 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6_BLANKING</name>
							<description>Comparator 6 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP6OUT</name>
							<description>Comparator 6 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP6LOCK</name>
							<description>Comparator 6 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>COMP7_CSR</name>
					<displayName>COMP7_CSR</displayName>
					<description>control and status register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>COMP7EN</name>
							<description>Comparator 7 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7MODE</name>
							<description>Comparator 7 mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7INSEL</name>
							<description>Comparator 7 inverting input selection</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7INPSEL</name>
							<description>Comparator 7 non inverted input selection</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7_OUT_SEL</name>
							<description>Comparator 7 output selection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>4</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7POL</name>
							<description>Comparator 7 output polarity</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7HYST</name>
							<description>Comparator 7 hysteresis</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7_BLANKING</name>
							<description>Comparator 7 blanking source</description>
							<bitOffset>18</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>COMP7OUT</name>
							<description>Comparator 7 output</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>COMP7LOCK</name>
							<description>Comparator 7 lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
					</fields>
				</register>
