MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>IPR14</name>
					<displayName>IPR14</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x438</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR15</name>
					<displayName>IPR15</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x43C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR16</name>
					<displayName>IPR16</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x440</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR17</name>
					<displayName>IPR17</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x444</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR18</name>
					<displayName>IPR18</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x448</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR19</name>
					<displayName>IPR19</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x44C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>IPR20</name>
					<displayName>IPR20</displayName>
					<description>Interrupt Priority Register</description>
					<addressOffset>0x450</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>IPR_N0</name>
							<description>IPR_N0</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N1</name>
							<description>IPR_N1</description>
							<bitOffset>8</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N2</name>
							<description>IPR_N2</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>IPR_N3</name>
							<description>IPR_N3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
