MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>OFR3</name>
					<displayName>OFR3</displayName>
					<description>offset register 3</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OFFSET3_EN</name>
							<description>OFFSET3_EN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFFSET3_CH</name>
							<description>OFFSET3_CH</description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>OFFSET3</name>
							<description>OFFSET3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OFR4</name>
					<displayName>OFR4</displayName>
					<description>offset register 4</description>
					<addressOffset>0x6C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>OFFSET4_EN</name>
							<description>OFFSET4_EN</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OFFSET4_CH</name>
							<description>OFFSET4_CH</description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>OFFSET4</name>
							<description>OFFSET4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>12</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>JDR1</name>
					<displayName>JDR1</displayName>
					<description>injected data register 1</description>
					<addressOffset>0x80</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA1</name>
							<description>JDATA1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>JDR2</name>
					<displayName>JDR2</displayName>
					<description>injected data register 2</description>
					<addressOffset>0x84</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA2</name>
							<description>JDATA2</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>JDR3</name>
					<displayName>JDR3</displayName>
					<description>injected data register 3</description>
					<addressOffset>0x88</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA3</name>
							<description>JDATA3</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>JDR4</name>
					<displayName>JDR4</displayName>
					<description>injected data register 4</description>
					<addressOffset>0x8C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>JDATA4</name>
							<description>JDATA4</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AWD2CR</name>
					<displayName>AWD2CR</displayName>
					<description>Analog Watchdog 2 Configuration Register</description>
					<addressOffset>0xA0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWD2CH</name>
							<description>AWD2CH</description>
							<bitOffset>1</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>AWD3CR</name>
					<displayName>AWD3CR</displayName>
					<description>Analog Watchdog 3 Configuration Register</description>
					<addressOffset>0xA4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AWD3CH</name>
							<description>AWD3CH</description>
							<bitOffset>1</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DIFSEL</name>
					<displayName>DIFSEL</displayName>
					<description>Differential Mode Selection Register 2</description>
					<addressOffset>0xB0</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIFSEL_1_15</name>
							<description>Differential mode for channels 15 to 1</description>
							<bitOffset>1</bitOffset>
							<bitWidth>15</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>DIFSEL_16_18</name>
							<description>Differential mode for channels 18 to 16</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CALFACT</name>
					<displayName>CALFACT</displayName>
					<description>Calibration Factors</description>
					<addressOffset>0xB4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALFACT_D</name>
							<description>CALFACT_D</description>
							<bitOffset>16</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
						<field>
							<name>CALFACT_S</name>
							<description>CALFACT_S</description>
							<bitOffset>0</bitOffset>
							<bitWidth>7</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CSR</name>
					<displayName>CSR</displayName>
					<description>ADC Common status register</description>
					<addressOffset>0x300</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>ADDRDY_MST</name>
							<description>ADDRDY_MST</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSMP_MST</name>
							<description>EOSMP_MST</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOC_MST</name>
							<description>EOC_MST</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOS_MST</name>
							<description>EOS_MST</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVR_MST</name>
							<description>OVR_MST</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOC_MST</name>
							<description>JEOC_MST</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOS_MST</name>
							<description>JEOS_MST</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD1_MST</name>
							<description>AWD1_MST</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD2_MST</name>
							<description>AWD2_MST</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD3_MST</name>
							<description>AWD3_MST</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JQOVF_MST</name>
							<description>JQOVF_MST</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADRDY_SLV</name>
							<description>ADRDY_SLV</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOSMP_SLV</name>
							<description>EOSMP_SLV</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOC_SLV</name>
							<description>End of regular conversion of the slave ADC</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EOS_SLV</name>
							<description>End of regular sequence flag of the slave ADC</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>OVR_SLV</name>
							<description>Overrun flag of the slave ADC</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOC_SLV</name>
							<description>End of injected conversion flag of the slave ADC</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JEOS_SLV</name>
							<description>End of injected sequence flag of the slave ADC</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD1_SLV</name>
							<description>Analog watchdog 1 flag of the slave ADC</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD2_SLV</name>
							<description>Analog watchdog 2 flag of the slave ADC</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AWD3_SLV</name>
							<description>Analog watchdog 3 flag of the slave ADC</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>JQOVF_SLV</name>
							<description>Injected Context Queue Overflow flag of the slave ADC</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCR</name>
					<displayName>CCR</displayName>
					<description>ADC common control register</description>
					<addressOffset>0x308</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MULT</name>
							<description>Multi ADC mode selection</description>
							<bitOffset>0</bitOffset>
							<bitWidth>5</bitWidth>
						</field>
						<field>
							<name>DELAY</name>
							<description>Delay between 2 sampling phases</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>DMACFG</name>
							<description>DMA configuration (for multi-ADC mode)</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MDMA</name>
							<description>Direct memory access mode for multi ADC mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CKMODE</name>
							<description>ADC clock mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>VREFEN</name>
							<description>VREFINT enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TSEN</name>
							<description>Temperature sensor enable</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>VBATEN</name>
							<description>VBAT enable</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CDR</name>
					<displayName>CDR</displayName>
					<description>ADC common regular data register for dual and triple modes</description>
					<addressOffset>0x30C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>RDATA_SLV</name>
							<description>Regular data of the slave ADC</description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>RDATA_MST</name>
							<description>Regular data of the master ADC</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
