MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SYSCFG</name>
			<description>System configuration controller</description>
			<groupName>SYSCFG</groupName>
			<baseAddress>0x40010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x19</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CFGR1</name>
					<displayName>CFGR1</displayName>
					<description>configuration register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>MEM_MODE</name>
							<description>Memory mapping selection bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>USB_IT_RMP</name>
							<description>USB interrupt remap</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM1_ITR_RMP</name>
							<description>Timer 1 ITR3 selection</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DAC_TRIG_RMP</name>
							<description>DAC trigger remap (when TSEL = 001)</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ADC24_DMA_RMP</name>
							<description>ADC24 DMA remapping bit</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM16_DMA_RMP</name>
							<description>TIM16 DMA request remapping bit</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM17_DMA_RMP</name>
							<description>TIM17 DMA request remapping bit</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM6_DAC1_DMA_RMP</name>
							<description>TIM6 and DAC1 DMA request remapping bit</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIM7_DAC2_DMA_RMP</name>
							<description>TIM7 and DAC2 DMA request remapping bit</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB6_FM</name>
							<description>Fast Mode Plus (FM+) driving capability activation bits.</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB7_FM</name>
							<description>Fast Mode Plus (FM+) driving capability activation bits.</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB8_FM</name>
							<description>Fast Mode Plus (FM+) driving capability activation bits.</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C_PB9_FM</name>
							<description>Fast Mode Plus (FM+) driving capability activation bits.</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C1_FM</name>
							<description>I2C1 Fast Mode Plus</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>I2C2_FM</name>
							<description>I2C2 Fast Mode Plus</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>ENCODER_MODE</name>
							<description>Encoder mode</description>
							<bitOffset>22</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FPU_IT</name>
							<description>Interrupt enable bits from FPU</description>
							<bitOffset>26</bitOffset>
							<bitWidth>6</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR1</name>
					<displayName>EXTICR1</displayName>
					<description>external interrupt configuration register 1</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EXTI3</name>
							<description>EXTI 3 configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI2</name>
							<description>EXTI 2 configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI1</name>
							<description>EXTI 1 configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI0</name>
							<description>EXTI 0 configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR2</name>
					<displayName>EXTICR2</displayName>
					<description>external interrupt configuration register 2</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EXTI7</name>
							<description>EXTI 7 configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI6</name>
							<description>EXTI 6 configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI5</name>
							<description>EXTI 5 configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI4</name>
							<description>EXTI 4 configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR3</name>
					<displayName>EXTICR3</displayName>
					<description>external interrupt configuration register 3</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EXTI11</name>
							<description>EXTI 11 configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI10</name>
							<description>EXTI 10 configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI9</name>
							<description>EXTI 9 configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI8</name>
							<description>EXTI 8 configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EXTICR4</name>
					<displayName>EXTICR4</displayName>
					<description>external interrupt configuration register 4</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>EXTI15</name>
							<description>EXTI 15 configuration bits</description>
							<bitOffset>12</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI14</name>
							<description>EXTI 14 configuration bits</description>
							<bitOffset>8</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI13</name>
							<description>EXTI 13 configuration bits</description>
							<bitOffset>4</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EXTI12</name>
							<description>EXTI 12 configuration bits</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CFGR2</name>
					<displayName>CFGR2</displayName>
					<description>configuration register 2</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>LOCUP_LOCK</name>
							<description>Cortex-M0 LOCKUP bit enable bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM_PARITY_LOCK</name>
							<description>SRAM parity lock bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PVD_LOCK</name>
							<description>PVD lock enable bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BYP_ADD_PAR</name>
							<description>Bypass address bit 29 in parity calculation</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SRAM_PEF</name>
							<description>SRAM parity flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RCR</name>
					<displayName>RCR</displayName>
					<description>CCM SRAM protection register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000</resetValue>
					<fields>
						<field>
							<name>PAGE0_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE1_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE2_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE3_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE4_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE5_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE6_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PAGE7_WP</name>
							<description>CCM SRAM page write protection bit</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
