MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HRTIM_TIMA</name>
			<description>High Resolution Timer: TIMA</description>
			<groupName>HRTIM</groupName>
			<baseAddress>0x40017480</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x80</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>TIMACR</name>
					<displayName>TIMACR</displayName>
					<description>Timerx Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UPDGAT</name>
							<description>Update Gating</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
							<enumeratedValues>
								<name>UPDGAT</name>

								<enumeratedValue>
									<name>Independent</name>
									<description>the update occurs independently from the DMA burst transfer</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA_Completed</name>
									<description>the update occurs when the DMA burst transfer is completed</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DMA_Update_Event</name>
									<description>the update occurs on the update event following the DMA burst transfer completion</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_1</name>
									<description>the update occurs on a rising edge of HRTIM update enable input 1</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_2</name>
									<description>the update occurs on a rising edge of HRTIM update enable input 2</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_3</name>
									<description>the update occurs on a rising edge of HRTIM update enable input 3</description>
									<value>#0101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_1_Update_Event</name>
									<description>the update occurs on the update event following a rising edge of HRTIM update enable input 1</description>
									<value>#0110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_2_Update_Event</name>
									<description>the update occurs on the update event following a rising edge of HRTIM update enable input 2</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Enable_3_Update_Event</name>
									<description>the update occurs on the update event following a rising edge of HRTIM update enable input 3</description>
									<value>#1000</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PREEN</name>
							<description>Preload enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DACSYNC</name>
							<description>DAC Synchronization</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues derivedFrom="HRTIM_Master.MCR.DACSYNC.DACSYNC" />
						</field>
						<field>
							<name>MSTU</name>
							<description>Master Timer update</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEU</name>
							<description>TEU</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDU</name>
							<description>TDU</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCU</name>
							<description>TCU</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBU</name>
							<description>TBU</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTU</name>
							<description>Timerx reset update</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPU</name>
							<description>Timer x Repetition update</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DELCMP4</name>
							<description>CMP4 auto-delayed mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>DELCMP4</name>
								<enumeratedValue>
									<name>Always_Active</name>
									<description>CMP4 register is always active (standard compare mode)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_2</name>
									<description>CMP4 value is recomputed and is active following a capture 2 event</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_2_Or_Compare_1</name>
									<description>CMP4 value is recomputed and is active following a capture 2 event, or is recomputed and active after Compare 1 match (timeout function if capture 2 event is missing)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_2_Or_Compare_3</name>
									<description>CMP4 value is recomputed and is active following a capture event, or is recomputed and active after Compare 3 match (timeout function if capture event is missing)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DELCMP2</name>
							<description>Delayed CMP2 mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>DELCMP2</name>
								<enumeratedValue>
									<name>Always_Active</name>
									<description>CMP4 register is always active (standard compare mode)</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_1</name>
									<description>CMP2 value is recomputed and is active following a capture 1 event</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_1_Or_Compare_1</name>
									<description>CMP2 value is recomputed and is active following a capture 1 event, or is recomputed and active after Compare 1 match (timeout function if capture event is missing)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Capture_1_Or_Compare_3</name>
									<description>CMP2 value is recomputed and is active following a capture 1 event, or is recomputed and active after Compare 3 match (timeout function if capture event is missing)</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNCSTRT</name>
							<description>Synchronization Starts Timer x</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYNCRSTx</name>
							<description>Synchronization Resets Timer x</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSHPLL</name>
							<description>Push-Pull mode enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALF</name>
							<description>Half mode enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RETRIG</name>
							<description>Re-triggerable mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT</name>
							<description>Continuous mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CKPSC</name>
							<description>HRTIM Timer x Clock prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMAISR</name>
					<displayName>TIMAISR</displayName>
					<description>TimerA Interrupt Status Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>O2CPY</name>
							<description>Output 2 Copy</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>O1CPY</name>
							<description>Output 1 Copy</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>O2STAT</name>
							<description>Output 2 State</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>O1STAT</name>
							<description>Output 1 State</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPPSTAT</name>
							<description>Idle Push Pull Status</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPPSTAT</name>
							<description>Current Push Pull Status</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLYPRT</name>
							<description>Delayed Protection Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RST</name>
							<description>Reset Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2</name>
							<description>Output 2 Reset Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2</name>
							<description>Output 2 Set Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1</name>
							<description>Output 1 Reset Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx1</name>
							<description>Output 1 Set Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2</name>
							<description>Capture2 Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1</name>
							<description>Capture1 Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPD</name>
							<description>Update Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REP</name>
							<description>Repetition Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4</name>
							<description>Compare 4 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3</name>
							<description>Compare 3 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2</name>
							<description>Compare 2 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1</name>
							<description>Compare 1 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMAICR</name>
					<displayName>TIMAICR</displayName>
					<description>Timerx Interrupt Clear Register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLYPRTC</name>
							<description>Delayed Protection Flag Clear</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTC</name>
							<description>Reset Interrupt flag Clear</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2C</name>
							<description>Output 2 Reset flag Clear</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET2xC</name>
							<description>Output 2 Set flag Clear</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1C</name>
							<description>Output 1 Reset flag Clear</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xC</name>
							<description>Output 1 Set flag Clear</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2C</name>
							<description>Capture2 Interrupt flag Clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1C</name>
							<description>Capture1 Interrupt flag Clear</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDC</name>
							<description>Update Interrupt flag Clear</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPC</name>
							<description>Repetition Interrupt flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4C</name>
							<description>Compare 4 Interrupt flag Clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3C</name>
							<description>Compare 3 Interrupt flag Clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2C</name>
							<description>Compare 2 Interrupt flag Clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1C</name>
							<description>Compare 1 Interrupt flag Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMADIER5</name>
					<displayName>TIMADIER5</displayName>
					<description>TIMxDIER5</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLYPRTDE</name>
							<description>DLYPRTDE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTDE</name>
							<description>RSTDE</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2DE</name>
							<description>RSTx2DE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2DE</name>
							<description>SETx2DE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1DE</name>
							<description>RSTx1DE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xDE</name>
							<description>SET1xDE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2DE</name>
							<description>CPT2DE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1DE</name>
							<description>CPT1DE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDDE</name>
							<description>UPDDE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPDE</name>
							<description>REPDE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4DE</name>
							<description>CMP4DE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3DE</name>
							<description>CMP3DE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2DE</name>
							<description>CMP2DE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1DE</name>
							<description>CMP1DE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLYPRTIE</name>
							<description>DLYPRTIE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTIE</name>
							<description>RSTIE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2IE</name>
							<description>RSTx2IE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2IE</name>
							<description>SETx2IE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1IE</name>
							<description>RSTx1IE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xIE</name>
							<description>SET1xIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2IE</name>
							<description>CPT2IE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1IE</name>
							<description>CPT1IE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDIE</name>
							<description>UPDIE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPIE</name>
							<description>REPIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4IE</name>
							<description>CMP4IE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3IE</name>
							<description>CMP3IE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2IE</name>
							<description>CMP2IE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1IE</name>
							<description>CMP1IE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTAR</name>
					<displayName>CNTAR</displayName>
					<description>Timerx Counter Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTx</name>
							<description>Timerx Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PERAR</name>
					<displayName>PERAR</displayName>
					<description>Timerx Period Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>PERx</name>
							<description>Timerx Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>REPAR</name>
					<displayName>REPAR</displayName>
					<description>Timerx Repetition Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REPx</name>
							<description>Timerx Repetition counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP1AR</name>
					<displayName>CMP1AR</displayName>
					<description>Timerx Compare 1 Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP1x</name>
							<description>Timerx Compare 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP1CAR</name>
					<displayName>CMP1CAR</displayName>
					<description>Timerx Compare 1 Compound Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REPx</name>
							<description>Timerx Repetition value (aliased from HRTIM_REPx register)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CMP1x</name>
							<description>Timerx Compare 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP2AR</name>
					<displayName>CMP2AR</displayName>
					<description>Timerx Compare 2 Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP2x</name>
							<description>Timerx Compare 2 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
