MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>CPT1ACR</name>
					<displayName>CPT1ACR</displayName>
					<description>Timerx Capture 2 Control Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TECMP2</name>
							<description>Timer E Compare 2</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TECMP1</name>
							<description>Timer E Compare 1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1RST</name>
							<description>Timer E output 1 Reset</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1SET</name>
							<description>Timer E output 1 Set</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP2</name>
							<description>Timer D Compare 2</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP1</name>
							<description>Timer D Compare 1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1RST</name>
							<description>Timer D output 1 Reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1SET</name>
							<description>Timer D output 1 Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP2</name>
							<description>Timer C Compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP1</name>
							<description>Timer C Compare 1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1RST</name>
							<description>Timer C output 1 Reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1SET</name>
							<description>Timer C output 1 Set</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBCMP2</name>
							<description>Timer B Compare 2</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBCMP1</name>
							<description>Timer B Compare 1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1RST</name>
							<description>Timer B output 1 Reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1SET</name>
							<description>Timer B output 1 Set</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV10CPT</name>
							<description>External Event 10 Capture</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV9CPT</name>
							<description>External Event 9 Capture</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV8CPT</name>
							<description>External Event 8 Capture</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV7CPT</name>
							<description>External Event 7 Capture</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV6CPT</name>
							<description>External Event 6 Capture</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV5CPT</name>
							<description>External Event 5 Capture</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV4CPT</name>
							<description>External Event 4 Capture</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV3CPT</name>
							<description>External Event 3 Capture</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV2CPT</name>
							<description>External Event 2 Capture</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV1CPT</name>
							<description>External Event 1 Capture</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDPCPT</name>
							<description>Update Capture</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWCPT</name>
							<description>Software Capture</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CPT2ACR</name>
					<displayName>CPT2ACR</displayName>
					<description>CPT2xCR</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TECMP2</name>
							<description>Timer E Compare 2</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TECMP1</name>
							<description>Timer E Compare 1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1RST</name>
							<description>Timer E output 1 Reset</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1SET</name>
							<description>Timer E output 1 Set</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP2</name>
							<description>Timer D Compare 2</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP1</name>
							<description>Timer D Compare 1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1RST</name>
							<description>Timer D output 1 Reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1SET</name>
							<description>Timer D output 1 Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP2</name>
							<description>Timer C Compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP1</name>
							<description>Timer C Compare 1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1RST</name>
							<description>Timer C output 1 Reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1SET</name>
							<description>Timer C output 1 Set</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBCMP2</name>
							<description>Timer B Compare 2</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBCMP1</name>
							<description>Timer B Compare 1</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1RST</name>
							<description>Timer B output 1 Reset</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1SET</name>
							<description>Timer B output 1 Set</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV10CPT</name>
							<description>External Event 10 Capture</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV9CPT</name>
							<description>External Event 9 Capture</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV8CPT</name>
							<description>External Event 8 Capture</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV7CPT</name>
							<description>External Event 7 Capture</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV6CPT</name>
							<description>External Event 6 Capture</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV5CPT</name>
							<description>External Event 5 Capture</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV4CPT</name>
							<description>External Event 4 Capture</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV3CPT</name>
							<description>External Event 3 Capture</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV2CPT</name>
							<description>External Event 2 Capture</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV1CPT</name>
							<description>External Event 1 Capture</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDPCPT</name>
							<description>Update Capture</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWCPT</name>
							<description>Software Capture</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OUTAR</name>
					<displayName>OUTAR</displayName>
					<description>Timerx Output Register</description>
					<addressOffset>0x64</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DIDL2</name>
							<description>Output 2 Deadtime upon burst mode Idle entry</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHP2</name>
							<description>Output 2 Chopper enable</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FAULT2</name>
							<description>Output 2 Fault state</description>
							<bitOffset>20</bitOffset>
							<bitWidth>2</bitWidth>

							<enumeratedValues>
								<name>FAULTx</name>
								<enumeratedValue>
									<name>No_Action</name>
									<description>No action: the output is not affected by the fault input and stays in run mode.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active</name>
									<description>Active</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Inactive</name>
									<description>Inactive</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>High_Z</name>
									<description>High-Z</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDLES2</name>
							<description>Output 2 Idle State</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IDLEM2</name>
							<description>Output 2 Idle mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POL2</name>
							<description>Output 2 polarity</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLYPRT</name>
							<description>Delayed Protection</description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>DLYPRTEN</name>
							<description>Delayed Protection Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTEN</name>
							<description>Deadtime enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DIDL1</name>
							<description>Output 1 Deadtime upon burst mode Idle entry</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CHP1</name>
							<description>Output 1 Chopper enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FAULT1</name>
							<description>Output 1 Fault state</description>
							<bitOffset>4</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues derivedFrom="FAULT2.FAULTx" />
						</field>
						<field>
							<name>IDLES1</name>
							<description>Output 1 Idle State</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>

							<enumeratedValues>
								<name>IDLES</name>
								<enumeratedValue>
									<name>Inactive</name>
									<description>Inactive</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active</name>
									<description>Active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>IDLEM1</name>
							<description>Output 1 Idle mode</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>POL1</name>
							<description>Output 1 polarity</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>

							<enumeratedValues>
								<name>POL</name>
								<enumeratedValue>
									<name>Active_High</name>
									<description>positive polarity (output active high)</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Active_Low</name>
									<description>negative polarity (output active low)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FLTAR</name>
					<displayName>FLTAR</displayName>
					<description>Timerx Fault Register</description>
					<addressOffset>0x68</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FLTLCK</name>
							<description>Fault sources Lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT5EN</name>
							<description>Fault 5 enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT4EN</name>
							<description>Fault 4 enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3EN</name>
							<description>Fault 3 enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2EN</name>
							<description>Fault 2 enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1EN</name>
							<description>Fault 1 enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
