MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HRTIM_TIMB</name>
			<description>High Resolution Timer: TIMB</description>
			<groupName>HRTIM</groupName>
			<baseAddress>0x40017500</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x80</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>TIMBCR</name>
					<displayName>TIMBCR</displayName>
					<description>Timerx Control Register</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>UPDGAT</name>
							<description>Update Gating</description>
							<bitOffset>28</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>PREEN</name>
							<description>Preload enable</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DACSYNC</name>
							<description>AC Synchronization</description>
							<bitOffset>25</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>MSTU</name>
							<description>Master Timer update</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEU</name>
							<description>TEU</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDU</name>
							<description>TDU</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCU</name>
							<description>TCU</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBU</name>
							<description>TBU</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TxRSTU</name>
							<description>Timerx reset update</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TxREPU</name>
							<description>Timer x Repetition update</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DELCMP4</name>
							<description>Delayed CMP4 mode</description>
							<bitOffset>14</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>DELCMP2</name>
							<description>Delayed CMP2 mode</description>
							<bitOffset>12</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>SYNCSTRTx</name>
							<description>Synchronization Starts Timer x</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYNCRSTx</name>
							<description>Synchronization Resets Timer x</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>PSHPLL</name>
							<description>Push-Pull mode enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>HALF</name>
							<description>Half mode enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RETRIG</name>
							<description>Re-triggerable mode</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CONT</name>
							<description>Continuous mode</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CK_PSCx</name>
							<description>HRTIM Timer x Clock prescaler</description>
							<bitOffset>0</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMBISR</name>
					<displayName>TIMBISR</displayName>
					<description>Timerx Interrupt Status Register</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>O2STAT</name>
							<description>Output 2 State</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>O1STAT</name>
							<description>Output 1 State</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>IPPSTAT</name>
							<description>Idle Push Pull Status</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPPSTAT</name>
							<description>Current Push Pull Status</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLYPRT</name>
							<description>Delayed Protection Flag</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RST</name>
							<description>Reset Interrupt Flag</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2</name>
							<description>Output 2 Reset Interrupt Flag</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2</name>
							<description>Output 2 Set Interrupt Flag</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1</name>
							<description>Output 1 Reset Interrupt Flag</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx1</name>
							<description>Output 1 Set Interrupt Flag</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2</name>
							<description>Capture2 Interrupt Flag</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1</name>
							<description>Capture1 Interrupt Flag</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPD</name>
							<description>Update Interrupt Flag</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REP</name>
							<description>Repetition Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4</name>
							<description>Compare 4 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3</name>
							<description>Compare 3 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2</name>
							<description>Compare 2 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1</name>
							<description>Compare 1 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMBICR</name>
					<displayName>TIMBICR</displayName>
					<description>Timerx Interrupt Clear Register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLYPRTC</name>
							<description>Delayed Protection Flag Clear</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTC</name>
							<description>Reset Interrupt flag Clear</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2C</name>
							<description>Output 2 Reset flag Clear</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET2xC</name>
							<description>Output 2 Set flag Clear</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1C</name>
							<description>Output 1 Reset flag Clear</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xC</name>
							<description>Output 1 Set flag Clear</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2C</name>
							<description>Capture2 Interrupt flag Clear</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1C</name>
							<description>Capture1 Interrupt flag Clear</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDC</name>
							<description>Update Interrupt flag Clear</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPC</name>
							<description>Repetition Interrupt flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4C</name>
							<description>Compare 4 Interrupt flag Clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3C</name>
							<description>Compare 3 Interrupt flag Clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2C</name>
							<description>Compare 2 Interrupt flag Clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1C</name>
							<description>Compare 1 Interrupt flag Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>TIMBDIER5</name>
					<displayName>TIMBDIER5</displayName>
					<description>TIMxDIER5</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DLYPRTDE</name>
							<description>DLYPRTDE</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTDE</name>
							<description>RSTDE</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2DE</name>
							<description>RSTx2DE</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2DE</name>
							<description>SETx2DE</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1DE</name>
							<description>RSTx1DE</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xDE</name>
							<description>SET1xDE</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2DE</name>
							<description>CPT2DE</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1DE</name>
							<description>CPT1DE</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDDE</name>
							<description>UPDDE</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPDE</name>
							<description>REPDE</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4DE</name>
							<description>CMP4DE</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3DE</name>
							<description>CMP3DE</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2DE</name>
							<description>CMP2DE</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1DE</name>
							<description>CMP1DE</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLYPRTIE</name>
							<description>DLYPRTIE</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTIE</name>
							<description>RSTIE</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx2IE</name>
							<description>RSTx2IE</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SETx2IE</name>
							<description>SETx2IE</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>RSTx1IE</name>
							<description>RSTx1IE</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SET1xIE</name>
							<description>SET1xIE</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT2IE</name>
							<description>CPT2IE</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CPT1IE</name>
							<description>CPT1IE</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDIE</name>
							<description>UPDIE</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>REPIE</name>
							<description>REPIE</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4IE</name>
							<description>CMP4IE</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP3IE</name>
							<description>CMP3IE</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2IE</name>
							<description>CMP2IE</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP1IE</name>
							<description>CMP1IE</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CNTR</name>
					<displayName>CNTR</displayName>
					<description>Timerx Counter Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CNTx</name>
							<description>Timerx Counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>PERBR</name>
					<displayName>PERBR</displayName>
					<description>Timerx Period Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x0000FFFF</resetValue>
					<fields>
						<field>
							<name>PERx</name>
							<description>Timerx Period value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>REPBR</name>
					<displayName>REPBR</displayName>
					<description>Timerx Repetition Register</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REPx</name>
							<description>Timerx Repetition counter value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP1BR</name>
					<displayName>CMP1BR</displayName>
					<description>Timerx Compare 1 Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP1x</name>
							<description>Timerx Compare 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP1CBR</name>
					<displayName>CMP1CBR</displayName>
					<description>Timerx Compare 1 Compound Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>REPx</name>
							<description>Timerx Repetition value (aliased from HRTIM_REPx register)</description>
							<bitOffset>16</bitOffset>
							<bitWidth>8</bitWidth>
						</field>
						<field>
							<name>CMP1x</name>
							<description>Timerx Compare 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP2BR</name>
					<displayName>CMP2BR</displayName>
					<description>Timerx Compare 2 Register</description>
					<addressOffset>0x24</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP2x</name>
							<description>Timerx Compare 2 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP3BR</name>
					<displayName>CMP3BR</displayName>
					<description>Timerx Compare 3 Register</description>
					<addressOffset>0x28</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP3x</name>
							<description>Timerx Compare 3 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CMP4BR</name>
					<displayName>CMP4BR</displayName>
					<description>Timerx Compare 4 Register</description>
					<addressOffset>0x2C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CMP4x</name>
							<description>Timerx Compare 4 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CPT1BR</name>
					<displayName>CPT1BR</displayName>
					<description>Timerx Capture 1 Register</description>
					<addressOffset>0x30</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CPT1x</name>
							<description>Timerx Capture 1 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CPT2BR</name>
					<displayName>CPT2BR</displayName>
					<description>Timerx Capture 2 Register</description>
					<addressOffset>0x34</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CPT2x</name>
							<description>Timerx Capture 2 value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DTBR</name>
					<displayName>DTBR</displayName>
					<description>Timerx Deadtime Register</description>
					<addressOffset>0x38</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>DTFLKx</name>
							<description>Deadtime Falling Lock</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTFSLKx</name>
							<description>Deadtime Falling Sign Lock</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SDTFx</name>
							<description>Sign Deadtime Falling value</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTFx</name>
							<description>Deadtime Falling value</description>
							<bitOffset>16</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
						<field>
							<name>DTRLKx</name>
							<description>Deadtime Rising Lock</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTRSLKx</name>
							<description>Deadtime Rising Sign Lock</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTPRSC</name>
							<description>Deadtime Prescaler</description>
							<bitOffset>10</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>SDTRx</name>
							<description>Sign Deadtime Rising value</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DTRx</name>
							<description>Deadtime Rising value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>9</bitWidth>
						</field>
					</fields>
				</register>
