MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>EEFBR1</name>
					<displayName>EEFBR1</displayName>
					<description>Timerx External Event Filtering Register 1</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EE5FLTR</name>
							<description>External Event 5 filter</description>
							<bitOffset>25</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE5LTCH</name>
							<description>External Event 5 latch</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE4FLTR</name>
							<description>External Event 4 filter</description>
							<bitOffset>19</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE4LTCH</name>
							<description>External Event 4 latch</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE3FLTR</name>
							<description>External Event 3 filter</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE3LTCH</name>
							<description>External Event 3 latch</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE2FLTR</name>
							<description>External Event 2 filter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE2LTCH</name>
							<description>External Event 2 latch</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE1FLTR</name>
							<description>External Event 1 filter</description>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE1LTCH</name>
							<description>External Event 1 latch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>EEFBR2</name>
					<displayName>EEFBR2</displayName>
					<description>Timerx External Event Filtering Register 2</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>EE10FLTR</name>
							<description>External Event 10 filter</description>
							<bitOffset>25</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE10LTCH</name>
							<description>External Event 10 latch</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE9FLTR</name>
							<description>External Event 9 filter</description>
							<bitOffset>19</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE9LTCH</name>
							<description>External Event 9 latch</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE8FLTR</name>
							<description>External Event 8 filter</description>
							<bitOffset>13</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE8LTCH</name>
							<description>External Event 8 latch</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE7FLTR</name>
							<description>External Event 7 filter</description>
							<bitOffset>7</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE7LTCH</name>
							<description>External Event 7 latch</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EE6FLTR</name>
							<description>External Event 6 filter</description>
							<bitOffset>1</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>EE6LTCH</name>
							<description>External Event 6 latch</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>RSTBR</name>
					<displayName>RSTBR</displayName>
					<description>TimerA Reset Register</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TIMECMP4</name>
							<description>Timer E Compare 4</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMECMP2</name>
							<description>Timer E Compare 2</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMECMP1</name>
							<description>Timer E Compare 1</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMDCMP4</name>
							<description>Timer D Compare 4</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMDCMP2</name>
							<description>Timer D Compare 2</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMDCMP1</name>
							<description>Timer D Compare 1</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMCCMP4</name>
							<description>Timer C Compare 4</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMCCMP2</name>
							<description>Timer C Compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMCCMP1</name>
							<description>Timer C Compare 1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMACMP4</name>
							<description>Timer A Compare 4</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMACMP2</name>
							<description>Timer A Compare 2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TIMACMP1</name>
							<description>Timer A Compare 1</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT10</name>
							<description>External Event 10</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT9</name>
							<description>External Event 9</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT8</name>
							<description>External Event 8</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT7</name>
							<description>External Event 7</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT6</name>
							<description>External Event 6</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT5</name>
							<description>External Event 5</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT4</name>
							<description>External Event 4</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT3</name>
							<description>External Event 3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT2</name>
							<description>External Event 2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXTEVNT1</name>
							<description>External Event 1</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSTCMP4</name>
							<description>Master compare 4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSTCMP3</name>
							<description>Master compare 3</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSTCMP2</name>
							<description>Master compare 2</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSTCMP1</name>
							<description>Master compare 1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSTPER</name>
							<description>Master timer Period</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP4</name>
							<description>Timer A compare 4 reset</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CMP2</name>
							<description>Timer A compare 2 reset</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UPDT</name>
							<description>Timer A Update reset</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CHPBR</name>
					<displayName>CHPBR</displayName>
					<description>Timerx Chopper Register</description>
					<addressOffset>0x58</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>STRTPW</name>
							<description>STRTPW</description>
							<bitOffset>7</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CHPDTY</name>
							<description>Timerx chopper duty cycle value</description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CHPFRQ</name>
							<description>Timerx carrier frequency value</description>
							<bitOffset>0</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CPT1BCR</name>
					<displayName>CPT1BCR</displayName>
					<description>Timerx Capture 2 Control Register</description>
					<addressOffset>0x5C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TECMP2</name>
							<description>Timer E Compare 2</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TECMP1</name>
							<description>Timer E Compare 1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1RST</name>
							<description>Timer E output 1 Reset</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1SET</name>
							<description>Timer E output 1 Set</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP2</name>
							<description>Timer D Compare 2</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP1</name>
							<description>Timer D Compare 1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1RST</name>
							<description>Timer D output 1 Reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1SET</name>
							<description>Timer D output 1 Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP2</name>
							<description>Timer C Compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP1</name>
							<description>Timer C Compare 1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1RST</name>
							<description>Timer C output 1 Reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1SET</name>
							<description>Timer C output 1 Set</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TACMP2</name>
							<description>Timer A Compare 2</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TACMP1</name>
							<description>Timer A Compare 1</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1RST</name>
							<description>Timer A output 1 Reset</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1SET</name>
							<description>Timer A output 1 Set</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV10CPT</name>
							<description>External Event 10 Capture</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV9CPT</name>
							<description>External Event 9 Capture</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV8CPT</name>
							<description>External Event 8 Capture</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV7CPT</name>
							<description>External Event 7 Capture</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV6CPT</name>
							<description>External Event 6 Capture</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV5CPT</name>
							<description>External Event 5 Capture</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV4CPT</name>
							<description>External Event 4 Capture</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV3CPT</name>
							<description>External Event 3 Capture</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV2CPT</name>
							<description>External Event 2 Capture</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV1CPT</name>
							<description>External Event 1 Capture</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDPCPT</name>
							<description>Update Capture</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWCPT</name>
							<description>Software Capture</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CPT2BCR</name>
					<displayName>CPT2BCR</displayName>
					<description>CPT2xCR</description>
					<addressOffset>0x60</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TECMP2</name>
							<description>Timer E Compare 2</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TECMP1</name>
							<description>Timer E Compare 1</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1RST</name>
							<description>Timer E output 1 Reset</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1SET</name>
							<description>Timer E output 1 Set</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP2</name>
							<description>Timer D Compare 2</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDCMP1</name>
							<description>Timer D Compare 1</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1RST</name>
							<description>Timer D output 1 Reset</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1SET</name>
							<description>Timer D output 1 Set</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP2</name>
							<description>Timer C Compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCCMP1</name>
							<description>Timer C Compare 1</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1RST</name>
							<description>Timer C output 1 Reset</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1SET</name>
							<description>Timer C output 1 Set</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TACMP2</name>
							<description>Timer A Compare 2</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TACMP1</name>
							<description>Timer A Compare 1</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1RST</name>
							<description>Timer A output 1 Reset</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1SET</name>
							<description>Timer A output 1 Set</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV10CPT</name>
							<description>External Event 10 Capture</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV9CPT</name>
							<description>External Event 9 Capture</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV8CPT</name>
							<description>External Event 8 Capture</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV7CPT</name>
							<description>External Event 7 Capture</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV6CPT</name>
							<description>External Event 6 Capture</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV5CPT</name>
							<description>External Event 5 Capture</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV4CPT</name>
							<description>External Event 4 Capture</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV3CPT</name>
							<description>External Event 3 Capture</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV2CPT</name>
							<description>External Event 2 Capture</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>EXEV1CPT</name>
							<description>External Event 1 Capture</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>UDPCPT</name>
							<description>Update Capture</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SWCPT</name>
							<description>Software Capture</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
