MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>HRTIM_Common</name>
			<description>High Resolution Timer: Common functions</description>
			<groupName>HRTIM</groupName>
			<baseAddress>0x40017780</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x80</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CR1</name>
					<displayName>CR1</displayName>
					<description>Control Register 1</description>
					<addressOffset>0x0</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AD4USRC</name>
							<description>ADC Trigger 4 Update Source</description>
							<bitOffset>25</bitOffset>
							<bitWidth>3</bitWidth>

							<enumeratedValues>
								<name>ADxUSRC</name>
								<enumeratedValue>
									<name>Master</name>
									<description>Master Timer</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_A</name>
									<description>Timer A</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_B</name>
									<description>Timer B</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_C</name>
									<description>Timer C</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_D</name>
									<description>Timer D</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Timer_E</name>
									<description>Timer E</description>
									<value>#101</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>AD3USRC</name>
							<description>ADC Trigger 3 Update Source</description>
							<bitOffset>22</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues derivedFrom="ADxUSRC" />
						</field>
						<field>
							<name>AD2USRC</name>
							<description>ADC Trigger 2 Update Source</description>
							<bitOffset>19</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues derivedFrom="ADxUSRC" />
						</field>
						<field>
							<name>AD1USRC</name>
							<description>ADC Trigger 1 Update Source</description>
							<bitOffset>16</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues derivedFrom="ADxUSRC" />
						</field>
						<field>
							<name>TEUDIS</name>
							<description>Timer E Update Disable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDUDIS</name>
							<description>Timer D Update Disable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCUDIS</name>
							<description>Timer C Update Disable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBUDIS</name>
							<description>Timer B Update Disable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TAUDIS</name>
							<description>Timer A Update Disable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MUDIS</name>
							<description>Master Update Disable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CR2</name>
					<displayName>CR2</displayName>
					<description>Control Register 2</description>
					<addressOffset>0x4</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TERST</name>
							<description>Timer E counter software reset</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDRST</name>
							<description>Timer D counter software reset</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCRST</name>
							<description>Timer C counter software reset</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBRST</name>
							<description>Timer B counter software reset</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TARST</name>
							<description>Timer A counter software reset</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MRST</name>
							<description>Master Counter software reset</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TESWU</name>
							<description>Timer E Software Update</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDSWU</name>
							<description>Timer D Software Update</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCSWU</name>
							<description>Timer C Software Update</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBSWU</name>
							<description>Timer B Software Update</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TASWU</name>
							<description>Timer A Software update</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MSWU</name>
							<description>Master Timer Software update</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ISR</name>
					<displayName>ISR</displayName>
					<description>Interrupt Status Register</description>
					<addressOffset>0x8</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BMPER</name>
							<description>Burst mode Period Interrupt Flag</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>DLLRDY</name>
							<description>DLL Ready Interrupt Flag</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>SYSFLT</name>
							<description>System Fault Interrupt Flag</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FLT5</name>
							<description>Fault 5 Interrupt Flag</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLT4</name>
							<description>Fault 4 Interrupt Flag</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLT3</name>
							<description>Fault 3 Interrupt Flag</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLT2</name>
							<description>Fault 2 Interrupt Flag</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
						<field>
							<name>FLT1</name>
							<description>Fault 1 Interrupt Flag</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ICR</name>
					<displayName>ICR</displayName>
					<description>Interrupt Clear Register</description>
					<addressOffset>0xC</addressOffset>
					<size>0x20</size>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BMPERC</name>
							<description>Burst mode period flag Clear</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>DLLRDYC</name>
							<description>DLL Ready Interrupt flag Clear</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>SYSFLTC</name>
							<description>System Fault Interrupt Flag Clear</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-write</access>
						</field>
						<field>
							<name>FLT5C</name>
							<description>Fault 5 Interrupt Flag Clear</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLT4C</name>
							<description>Fault 4 Interrupt Flag Clear</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLT3C</name>
							<description>Fault 3 Interrupt Flag Clear</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLT2C</name>
							<description>Fault 2 Interrupt Flag Clear</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
						<field>
							<name>FLT1C</name>
							<description>Fault 1 Interrupt Flag Clear</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>IER</name>
					<displayName>IER</displayName>
					<description>Interrupt Enable Register</description>
					<addressOffset>0x10</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BMPERIE</name>
							<description>Burst mode period Interrupt Enable</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>DLLRDYIE</name>
							<description>DLL Ready Interrupt Enable</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>SYSFLTE</name>
							<description>System Fault Interrupt Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT5IE</name>
							<description>Fault 5 Interrupt Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT4IE</name>
							<description>Fault 4 Interrupt Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3IE</name>
							<description>Fault 3 Interrupt Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2IE</name>
							<description>Fault 2 Interrupt Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1IE</name>
							<description>Fault 1 Interrupt Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>OENR</name>
					<displayName>OENR</displayName>
					<description>Output Enable Register</description>
					<addressOffset>0x14</addressOffset>
					<size>0x20</size>
					<access>write-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TE2OEN</name>
							<description>Timer E Output 2 Enable</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1OEN</name>
							<description>Timer E Output 1 Enable</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD2OEN</name>
							<description>Timer D Output 2 Enable</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1OEN</name>
							<description>Timer D Output 1 Enable</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC2OEN</name>
							<description>Timer C Output 2 Enable</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1OEN</name>
							<description>Timer C Output 1 Enable</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB2OEN</name>
							<description>Timer B Output 2 Enable</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1OEN</name>
							<description>Timer B Output 1 Enable</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA2OEN</name>
							<description>Timer A Output 2 Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1OEN</name>
							<description>Timer A Output 1 Enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DISR</name>
					<displayName>DISR</displayName>
					<description>DISR</description>
					<addressOffset>0x18</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TE2ODIS</name>
							<description>TE2ODIS</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1ODIS</name>
							<description>TE1ODIS</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD2ODIS</name>
							<description>TD2ODIS</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1ODIS</name>
							<description>TD1ODIS</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC2ODIS</name>
							<description>TC2ODIS</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1ODIS</name>
							<description>TC1ODIS</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB2ODIS</name>
							<description>TB2ODIS</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1ODIS</name>
							<description>TB1ODIS</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA2ODIS</name>
							<description>TA2ODIS</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1ODIS</name>
							<description>TA1ODIS</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ODSR</name>
					<displayName>ODSR</displayName>
					<description>Output Disable Status Register</description>
					<addressOffset>0x1C</addressOffset>
					<size>0x20</size>
					<access>read-only</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>TE2ODS</name>
							<description>Timer E Output 2 disable status</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TE1ODS</name>
							<description>Timer E Output 1 disable status</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD2ODS</name>
							<description>Timer D Output 2 disable status</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TD1ODS</name>
							<description>Timer D Output 1 disable status</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC2ODS</name>
							<description>Timer C Output 2 disable status</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TC1ODS</name>
							<description>Timer C Output 1 disable status</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB2ODS</name>
							<description>Timer B Output 2 disable status</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TB1ODS</name>
							<description>Timer B Output 1 disable status</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA2ODS</name>
							<description>Timer A Output 2 disable status</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TA1ODS</name>
							<description>Timer A Output 1 disable status</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>BMCR</name>
					<displayName>BMCR</displayName>
					<description>Burst Mode Control Register</description>
					<addressOffset>0x20</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>BMSTAT</name>
							<description>Burst Mode Status</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TEBM</name>
							<description>Timer E Burst Mode</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TDBM</name>
							<description>Timer D Burst Mode</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TCBM</name>
							<description>Timer C Burst Mode</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TBBM</name>
							<description>Timer B Burst Mode</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>TABM</name>
							<description>Timer A Burst Mode</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>MTBM</name>
							<description>Master Timer Burst Mode</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMPREN</name>
							<description>Burst Mode Preload Enable</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BMPRSC</name>
							<description>Burst Mode Prescaler</description>
							<bitOffset>6</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BMCLK</name>
							<description>Burst Mode Clock source</description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>BMOM</name>
							<description>Burst Mode operating mode</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>BME</name>
							<description>Burst Mode enable</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
