MuratovAS/VScode_Docker_Stm32/firmware/openocd/STM32F334.svd
				<register>
					<name>ADC2R</name>
					<displayName>ADC2R</displayName>
					<description>ADC Trigger 2 Register</description>
					<addressOffset>0x40</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AD2TERST</name>
							<description>ADC trigger 2 on Timer E Reset</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC4</name>
							<description>ADC trigger 2 on Timer E compare 4</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC3</name>
							<description>ADC trigger 2 on Timer E compare 3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC2</name>
							<description>ADC trigger 2 on Timer E compare 2</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDRST</name>
							<description>ADC trigger 2 on Timer D Reset</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDPER</name>
							<description>ADC trigger 2 on Timer D Period</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC4</name>
							<description>ADC trigger 2 on Timer D compare 4</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC3</name>
							<description>ADC trigger 2 on Timer D compare 3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC2</name>
							<description>ADC trigger 2 on Timer D compare 2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCRST</name>
							<description>ADC trigger 2 on Timer C Reset</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCPER</name>
							<description>ADC trigger 2 on Timer C Period</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC4</name>
							<description>ADC trigger 2 on Timer C compare 4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC3</name>
							<description>ADC trigger 2 on Timer C compare 3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC2</name>
							<description>ADC trigger 2 on Timer C compare 2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBPER</name>
							<description>ADC trigger 2 on Timer B Period</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC4</name>
							<description>ADC trigger 2 on Timer B compare 4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC3</name>
							<description>ADC trigger 2 on Timer B compare 3</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC2</name>
							<description>ADC trigger 2 on Timer B compare 2</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAPER</name>
							<description>ADC trigger 2 on Timer A Period</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC4</name>
							<description>ADC trigger 2 on Timer A compare 4</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC3</name>
							<description>ADC trigger 2 on Timer A compare 3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC2</name>
							<description>ADC trigger 2 on Timer A compare 2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV10</name>
							<description>ADC trigger 2 on External Event 10</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV9</name>
							<description>ADC trigger 2 on External Event 9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV8</name>
							<description>ADC trigger 2 on External Event 8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV7</name>
							<description>ADC trigger 2 on External Event 7</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV6</name>
							<description>ADC trigger 2 on External Event 6</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MPER</name>
							<description>ADC trigger 2 on Master Period</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC4</name>
							<description>ADC trigger 2 on Master Compare 4</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC3</name>
							<description>ADC trigger 2 on Master Compare 3</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC2</name>
							<description>ADC trigger 2 on Master Compare 2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC1</name>
							<description>ADC trigger 2 on Master Compare 1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC3R</name>
					<displayName>ADC3R</displayName>
					<description>ADC Trigger 3 Register</description>
					<addressOffset>0x44</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AD1TEPER</name>
							<description>AD1TEPER</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TEC4</name>
							<description>AD1TEC4</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TEC3</name>
							<description>AD1TEC3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TEC2</name>
							<description>AD1TEC2</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TDPER</name>
							<description>AD1TDPER</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TDC4</name>
							<description>AD1TDC4</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TDC3</name>
							<description>AD1TDC3</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TDC2</name>
							<description>AD1TDC2</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TCPER</name>
							<description>AD1TCPER</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TCC4</name>
							<description>AD1TCC4</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TCC3</name>
							<description>AD1TCC3</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TCC2</name>
							<description>AD1TCC2</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TBRST</name>
							<description>AD1TBRST</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TBPER</name>
							<description>AD1TBPER</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TBC4</name>
							<description>AD1TBC4</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TBC3</name>
							<description>AD1TBC3</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TBC2</name>
							<description>AD1TBC2</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TARST</name>
							<description>AD1TARST</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TAPER</name>
							<description>AD1TAPER</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TAC4</name>
							<description>AD1TAC4</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TAC3</name>
							<description>AD1TAC3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1TAC2</name>
							<description>AD1TAC2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1EEV5</name>
							<description>AD1EEV5</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1EEV4</name>
							<description>AD1EEV4</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1EEV3</name>
							<description>AD1EEV3</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1EEV2</name>
							<description>AD1EEV2</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1EEV1</name>
							<description>AD1EEV1</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1MPER</name>
							<description>AD1MPER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1MC4</name>
							<description>AD1MC4</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1MC3</name>
							<description>AD1MC3</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1MC2</name>
							<description>AD1MC2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD1MC1</name>
							<description>AD1MC1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>ADC4R</name>
					<displayName>ADC4R</displayName>
					<description>ADC Trigger 4 Register</description>
					<addressOffset>0x48</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>AD2TERST</name>
							<description>AD2TERST</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC4</name>
							<description>AD2TEC4</description>
							<bitOffset>30</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC3</name>
							<description>AD2TEC3</description>
							<bitOffset>29</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TEC2</name>
							<description>AD2TEC2</description>
							<bitOffset>28</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDRST</name>
							<description>AD2TDRST</description>
							<bitOffset>27</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDPER</name>
							<description>AD2TDPER</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC4</name>
							<description>AD2TDC4</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC3</name>
							<description>AD2TDC3</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TDC2</name>
							<description>AD2TDC2</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCRST</name>
							<description>AD2TCRST</description>
							<bitOffset>22</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCPER</name>
							<description>AD2TCPER</description>
							<bitOffset>21</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC4</name>
							<description>AD2TCC4</description>
							<bitOffset>20</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC3</name>
							<description>AD2TCC3</description>
							<bitOffset>19</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TCC2</name>
							<description>AD2TCC2</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBPER</name>
							<description>AD2TBPER</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC4</name>
							<description>AD2TBC4</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC3</name>
							<description>AD2TBC3</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TBC2</name>
							<description>AD2TBC2</description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAPER</name>
							<description>AD2TAPER</description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC4</name>
							<description>AD2TAC4</description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC3</name>
							<description>AD2TAC3</description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2TAC2</name>
							<description>AD2TAC2</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV10</name>
							<description>AD2EEV10</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV9</name>
							<description>AD2EEV9</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV8</name>
							<description>AD2EEV8</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV7</name>
							<description>AD2EEV7</description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2EEV6</name>
							<description>AD2EEV6</description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MPER</name>
							<description>AD2MPER</description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC4</name>
							<description>AD2MC4</description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC3</name>
							<description>AD2MC3</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC2</name>
							<description>AD2MC2</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>AD2MC1</name>
							<description>AD2MC1</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>DLLCR</name>
					<displayName>DLLCR</displayName>
					<description>DLL Control Register</description>
					<addressOffset>0x4C</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>CALRTE</name>
							<description>DLL Calibration rate</description>
							<bitOffset>2</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>CALEN</name>
							<description>DLL Calibration Enable</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>CAL</name>
							<description>DLL Calibration Start</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FLTINR1</name>
					<displayName>FLTINR1</displayName>
					<description>HRTIM Fault Input Register 1</description>
					<addressOffset>0x50</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FLT4LCK</name>
							<description>FLT4LCK</description>
							<bitOffset>31</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT4F</name>
							<description>FLT4F</description>
							<bitOffset>27</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FLT4SRC</name>
							<description>FLT4SRC</description>
							<bitOffset>26</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT4P</name>
							<description>FLT4P</description>
							<bitOffset>25</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT4E</name>
							<description>FLT4E</description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3LCK</name>
							<description>FLT3LCK</description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3F</name>
							<description>FLT3F</description>
							<bitOffset>19</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FLT3SRC</name>
							<description>FLT3SRC</description>
							<bitOffset>18</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3P</name>
							<description>FLT3P</description>
							<bitOffset>17</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT3E</name>
							<description>FLT3E</description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2LCK</name>
							<description>FLT2LCK</description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2F</name>
							<description>FLT2F</description>
							<bitOffset>11</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FLT2SRC</name>
							<description>FLT2SRC</description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2P</name>
							<description>FLT2P</description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT2E</name>
							<description>FLT2E</description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1LCK</name>
							<description>FLT1LCK</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1F</name>
							<description>FLT1F</description>
							<bitOffset>3</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FLT1SRC</name>
							<description>FLT1SRC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1P</name>
							<description>FLT1P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT1E</name>
							<description>FLT1E</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>FLTINR2</name>
					<displayName>FLTINR2</displayName>
					<description>HRTIM Fault Input Register 2</description>
					<addressOffset>0x54</addressOffset>
					<size>0x20</size>
					<access>read-write</access>
					<resetValue>0x00000000</resetValue>
					<fields>
						<field>
							<name>FLTSD</name>
							<description>FLTSD</description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
						</field>
						<field>
							<name>FLT5LCK</name>
							<description>FLT5LCK</description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT5F</name>
							<description>FLT5F</description>
							<bitOffset>3</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>FLT5SRC</name>
							<description>FLT5SRC</description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT5P</name>
							<description>FLT5P</description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
						<field>
							<name>FLT5E</name>
							<description>FLT5E</description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
						</field>
					</fields>
				</register>
